const allPrayers = [
  {
      id: "morazkar",
      name: "أذكــار الصبــاح",
      prayers: [
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ }",
              times: 1
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ * لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ }",
              times: 3
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِنْ شَرِّ مَا خَلَقَ * وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ }",
              times: 3
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَهِ النَّاسِ * مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ }",
              times: 3
          },
          {
              text: "أصبحنا وأصبح الملك لله والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، ربِّ أسألك خير ما في هذا اليوم وخير ما بعده وأعوذ بك من شر ما في هذا اليوم وشر ما بعده ربِّ أعوذ بك من الكسل وسوء الكبر، ربَّ أعوذ بك من عذابٍ في النار وعذاب في القبر",
              times: 1
          },
          {
              text: "اللهم أنت ربي لا إله إلا أنت خَلَقتني وأنا عَبْدُك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت أبوء لك بنعمتك علي وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت",
              times: 1
          },
          {
              text: "رضيت بالله رباً ، وبالإسلام ديناً وبمحمد صلى الله عليه وسلم نبياً",
              times: 3
          },
          {
              text: "اللهم إني أصبحت أشهدك وأشهد حملة عرشك ، وملائكتك وجميع خلقك ، أنك أنت الله لا إله إلا أنت وحدك لا شريك لك ، وأن محمداً عبدك ورسولك",
              times: 4
          },
          {
              text: "اللهم ما أصبح بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك ، فلك الحمد ولك الشكر",
              times: 1
          },
          {
              text: "حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم",
              times: 7
          },
          {
              text: "بسم الله الذي لا يضرُّ مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم",
              times: 3
          },
          {
              text: "اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت وإليك النشور",
              times: 1
          },
          {
              text: "أصبحنا على فطرة الإسلام وعلى كلمة الإخلاص، وعلى دين نبيَّنا محمد صلى الله عليه وسلم وعلى ملَّة أبينا إبراهيم حنيفاً مسلماً وما كان من المشركين",
              times: 1
          },
          {
              text: "سبحان الله وبحمده عدد خلقهِ ورِضَا نفسِهِ وزِنُة عَرشِهِ ومِداد كلماته",
              times: 3
          },
          {
              text: "اللهم عافني في بَدَني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت",
              times: 3
          },
          {
              text: "اللهم إني أعوذ بك من الكفر، والفقر، اللهم إني أعوذ بك من عذاب القبر لا إله إلا أنت",
              times: 3
          },
          {
              text: "اللهم إني أسألك العفو والعافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي،اللهم استر عوراتي وآمن روعاتي، اللهم احفظني من بين يديَّ ومن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذ بعظمتك أن أغتال من تحتي",
              times: 1
          },
          {
              text: "يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كُله ولا تَكِلْني إلى نفسي طرفة عين",
              times: 3
          },
          {
              text: "أصبحنا وأصبح الملك لله رب العالمين اللهم إني أسألك خير هذا اليوم فتحه، ونصره ،ونوره ،وبركته، وهداه، وأعوذ بك من شر ما فيه وشر ما بعده",
              times: 1
          },
          {
              text: "اللهم عَالِمَ الغيب والشَّهادة، فاطر السموات والأرض، رب كل شيء ومليكه، أشهد أن لا إله إلا أنت أعوذ بك من شر نفسي ومن شر الشيطان وشركه وأن اقترف على نفسي سوءًا أو أجُره إلى مسلم",
              times: 1
          },
          {
              text: "أعوذ بكلمات الله التامات من شر ما خلق",
              times: 3
          },
          {
              text: "اللهم صل وسلم على نبينا محمد",
              times: 10
          },
          {
              text: "اللهم إني أعوذ بك أن أشرك بك و أنا أعلم ، و استغفرك لما لا أعلم",
              times: 3
          },
          {
              text: "اللهم إنا نعوذ بك من الهم والحزن ونعوذ بك من العجز والكسل ونعوذ بك من الجبن والبخل ونعوذ بك من غلبة الدين وقهر الرجال",
              times: 3
          },
          {
              text: "أستغفر الله العظيم الذي لا إله إلا هو الحي القيوم وأتوب إليه",
              times: 3
          },
          {
              text: "اللهم لك الحمد كما ينبغي لجلال وجهك وعظيم سلطانك",
              times: 3
          },
          {
              text: "لا إله إلا الله وحده لا شريك له ،له الملك وله الحمد وهو على كل شيء قدير",
              times: 10
          },
          {
              text: "اللهم أنت ربي لا إله إلا أنت، عليك توكلت، وأنت رب العرش العظيم، ما شاء الله كان وما لم يشأ لم يكن، لا حول ولا قوة إلا بالله العلي العظيم، أعلم أن الله على كل شيء قدير، وأن الله قد أحاط بكل شيء علماً، اللهم إني أعوذ بك من شر نفسي ومن شر كل دابة أنت آخذٌ بناصيتها، إن ربي على صراط مستقيم",
              times: 1
          },
          {
              text: "سبحان الله وبحمده",
              times: 100
          }
      ]
  },
  {
      id: "salahtb",
      name: "أذكــار المســجد",
      prayers: [
          {
              text: "استغفر الله",
              times: 3
          },
          {
              text: "اللهم أنت السلام ومنك السلام تباركت ياذا الجلال والاكرام",
              times: 1
          },
          {
              text: "لاإله إلا الله وحده لاشريك له له الملك وله الحمد وهو على كل شيء قدير، اللهم لامانع لماأعطيت ، ولامعطي لمامنعت ولاينفع ذا الجد منك الجد",
              times: 1
          },
          {
              text: "لاإله إلا الله وحده لاشريك له له الملك وله الحمد وهو على كل شيء قدير",
              times: 1
          },
          {
              text: "سبحان الله والحمدلله والله أكبر",
              times: 33
          },
          {
              text: "لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيىء قدير",
              times: 10
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ * لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ }",
              times: 3
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِنْ شَرِّ مَا خَلَقَ * وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ }",
              times: 3
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَهِ النَّاسِ * مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ }",
              times: 3
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ }",
              times: 1
          }
      ]
  },
  {
      id: "sleeptb",
      name: "أذكــار النــوم",
      prayers: [
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ }",
              times: 1
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ * لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ }",
              times: 3
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِنْ شَرِّ مَا خَلَقَ * وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ }",
              times: 3
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَهِ النَّاسِ * مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ }",
              times: 3
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ {آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ * لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ }",
              times: 1
          },
          {
              text: "بإسمك ربي وضعت جنبي وبك أرفعه ، إن أمسكت نفسي فارحمها ، وإن أرسلتها فاحفظها بما تحفظ به عبادك الصالحين",
              times: 1
          },
          {
              text: "اللهم إنك خلقت نفسي وأنت توفاها، لك مماتها ومحياها، إن أحييتها فاحفظها، وإن أمتها فاغفر لها، اللهم إني أسألك العافية",
              times: 1
          },
          {
              text: "اللهم قني عذابك يوم تبعث عبادك",
              times: 3
          },
          {
              text: "باسمك اللهم أموت و أحيا",
              times: 1
          },
          {
              text: "الحمد لله الذي أطعمنا وسقانا وكفانا وآوانا فكم ممن لا كافي له ولا مؤوي",
              times: 1
          },
          {
              text: "اللهم فاطر السماوات والأرض عالم الغيب والشهادة رب كل شيء ومليكه أعوذ بك من شر نفسي وشر الشيطان وشركه وأن أقترف على نفسي سوءا أو أجره إلى مسلم",
              times: 1
          },
          {
              text: "اللهم أسلمت نفسي إليك،و وجهت وجهي إليك، و فوضت أمري إليك، و ألجأت ظهري إليك، رغبة و رهبة إليك، لا منجا و لا ملجأ منك إلا إليك، آمنت بكتابك الذي أنزلت، و نبيك الذي أرسلت",
              times: 1
          }
      ]
  },
  {
      id: "t7seentb",
      name: "أذكــار التحصــين",
      prayers: [
          {
              text: "أعيذك بكلمات الله التامه من كل شيطان وهامّه ومن كل عين لامّه",
              times: 7
          },
          {
              text: "أعيذك بكلمات الله التامات التي لا يجاوزهن برّ ولا فاجر من شر ما خلق وبرأ وذرأ ومن شر ما ينزل من السماء ومن شر ما يعرج فيها ومن شر ما يخرج من الأرض ومن شر ما يكمن فيها ومن شر فتن الليل والنهار ومن شر كل طارق إلا طارق يطرق بخير يا رحمان",
              times: 1
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِنْ شَرِّ مَا خَلَقَ * وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ }",
              times: 3
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَهِ النَّاسِ * مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ }",
              times: 3
          }
      ]
  },
  {
      id: "roqyatb",
      name: "الرقيــة الشرعيــة",
      prayers: [
          {
              text: "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ * الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ * الرَّحْمَنِ الرَّحِيمِ * مَالِكِ يَوْمِ الدِّينِ * إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ * اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ * صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلا الضَّالِّينَ *",
              times: 1
          },
          {
              text: "أعوذ بالله من الشيطان الرجيم { اللَّهُ لا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لا تَأْخُذُهُ سِنَةٌ وَلا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلا يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ }",
              times: 1
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ {آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ * لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ }",
              times: 1
          },
          {
              text: "أعوذ بالله من الشيطان الرجيم { وَأَوْحَيْنَا إِلَى مُوسَى أَنْ أَلْقِ عَصَاكَ فَإِذَا هِيَ تَلْقَفُ مَا يَأْفِكُونَ * فَوَقَعَ الْحَقُّ وَبَطَلَ مَا كَانُوا يَعْمَلُونَ * فَغُلِبُوا هُنَالِكَ وَانْقَلَبُوا صَاغِرِينَ }",
              times: 1
          },
          {
              text: "أعوذ بالله من الشيطان الرجيم { وَقَالَ فِرْعَوْنُ ائْتُونِي بِكُلِّ سَاحِرٍ عَلِيمٍ * فَلَمَّا جَاءَ السَّحَرَةُ قَالَ لَهُمْ مُوسَى أَلْقُوا مَا أَنْتُمْ مُلْقُونَ * فَلَمَّا أَلْقَوْا قَالَ مُوسَى مَا جِئْتُمْ بِهِ السِّحْرُ إِنَّ اللَّهَ سَيُبْطِلُهُ إِنَّ اللَّهَ لا يُصْلِحُ عَمَلَ الْمُفْسِدِينَ * وَيُحِقُّ اللَّهُ الْحَقَّ بِكَلِمَاتِهِ وَلَوْ كَرِهَ الْمُجْرِمُونَ }",
              times: 1
          },
          {
              text: "أعوذ بالله من الشيطان الرجيم  { قَالُوا يَا مُوسَى إِمَّا أَنْ تُلْقِيَ وَإِمَّا أَنْ نَكُونَ أَوَّلَ مَنْ أَلْقَى * قَالَ بَلْ أَلْقُوا فَإِذَا حِبَالُهُمْ وَعِصِيُّهُمْ يُخَيَّلُ إِلَيْهِ مِنْ سِحْرِهِمْ أَنَّهَا تَسْعَى * فَأَوْجَسَ فِي نَفْسِهِ خِيفَةً مُوسَى * قُلْنَا لا تَخَفْ إِنَّكَ أَنْتَ الْأَعْلَى * وَأَلْقِ مَا فِي يَمِينِكَ تَلْقَفْ مَا صَنَعُوا إِنَّمَا صَنَعُوا كَيْدُ سَاحِرٍ وَلا يُفْلِحُ السَّاحِرُ حَيْثُ أَتَى }",
              times: 1
          },
          {
              text: "أعوذ بالله من الشيطان الرجيم { فَتَعَالَى اللَّهُ الْمَلِكُ الْحَقُّ لا إِلَهَ إِلَّا هُوَ رَبُّ الْعَرْشِ الْكَرِيمِ * وَمَنْ يَدْعُ مَعَ اللَّهِ إِلَهاً آخَرَ لا بُرْهَانَ لَهُ بِهِ فَإِنَّمَا حِسَابُهُ عِنْدَ رَبِّهِ إِنَّهُ لا يُفْلِحُ الْكَافِرُونَ * وَقُلْ رَبِّ اغْفِرْ وَارْحَمْ وَأَنْتَ خَيْرُ الرَّاحِمِينَ }",
              times: 1
          },
          {
              text: "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { وَالصَّافَّاتِ صَفّاً * فَالزَّاجِرَاتِ زَجْراً * فَالتَّالِيَاتِ ذِكْراً * إِنَّ إِلَهَكُمْ لَوَاحِدٌ * رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا وَرَبُّ الْمَشَارِقِ * إِنَّا زَيَّنَّا السَّمَاءَ الدُّنْيَا بِزِينَةٍ الْكَوَاكِبِ * وَحِفْظاً مِنْ كُلِّ شَيْطَانٍ مَارِدٍ * لا يَسَّمَّعُونَ إِلَى الْمَلَأِ الْأَعْلَى وَيُقْذَفُونَ مِنْ كُلِّ جَانِبٍ * دُحُوراً وَلَهُمْ عَذَابٌ وَاصِبٌ * إِلَّا مَنْ خَطِفَ الْخَطْفَةَ فَأَتْبَعَهُ شِهَابٌ ثَاقِبٌ }",
              times: 1
          },
          {
              text: "أعوذ بالله من الشيطان الرجيم { يَا مَعْشَرَ الْجِنِّ وَالْأِنْسِ إِنِ اسْتَطَعْتُمْ أَنْ تَنْفُذُوا مِنْ أَقْطَارِ السَّمَاوَاتِ وَالْأَرْضِ فَانْفُذُوا لا تَنْفُذُونَ إِلَّا بِسُلْطَانٍ * فَبِأَيِّ آلاءِ رَبِّكُمَا تُكَذِّبَانِ * يُرْسَلُ عَلَيْكُمَا شُوَاظٌ مِنْ نَارٍ وَنُحَاسٌ فَلا تَنْتَصِرَانِ }",
              times: 1
          },
          {
              text: "أعوذ بالله من الشيطان الرجيم { هُوَ اللَّهُ الَّذِي لا إِلَهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ هُوَ الرَّحْمَنُ الرَّحِيمُ * هُوَ اللَّهُ الَّذِي لا إِلَهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ * هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْأَسْمَاءُ الْحُسْنَى يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ }",
              times: 1
          },
          {
              text: "بسم الله الرحمن الرحيم { أُوحِيَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِنَ الْجِنِّ فَقَالُوا إِنَّا سَمِعْنَا قُرْآناً عَجَباً * يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ وَلَنْ نُشْرِكَ بِرَبِّنَا أَحَداً * وَأَنَّهُ تَعَالَى جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَةً وَلا وَلَداً * وَأَنَّهُ كَانَ يَقُولُ سَفِيهُنَا عَلَى اللَّهِ شَطَطاً * وَأَنَّا ظَنَنَّا أَنْ لَنْ تَقُولَ الْأِنْسُ وَالْجِنُّ عَلَى اللَّهِ كَذِباً }",
              times: 1
          },
          {
              text: "أعوذ بالله من الشيطان الرجيم { وَإِنْ يَكَادُ الَّذِينَ كَفَرُوا لَيُزْلِقُونَكَ بِأَبْصَارِهِمْ لَمَّا سَمِعُوا الذِّكْرَ وَيَقُولُونَ إِنَّهُ لَمَجْنُونٌ * وَمَا هُوَ إِلَّا ذِكْرٌ لِلْعَالَمِينَ }",
              times: 1
          },
          {
              text: "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { قُلْ يَا أَيُّهَا الْكَافِرُونَ * لا أَعْبُدُ مَا تَعْبُدُونَ * وَلا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ * وَلا أَنَا عَابِدٌ مَا عَبَدْتُمْ * وَلا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ * لَكُمْ دِينُكُمْ وَلِيَ دِينِ }",
              times: 1
          },
          {
              text: "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ * لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ }",
              times: 1
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِنْ شَرِّ مَا خَلَقَ * وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ }",
              times: 1
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَهِ النَّاسِ * مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ }",
              times: 1
          },
          {
              text: "اللهم رب الناس أذهب البأس واشف أنت الشافي لا شفاء إلا شفاؤك شفاء لا يغادر سقما",
              times: 7
          },
          {
              text: "أسأل الله العظيم رب العرش العظيم أن يشفيك",
              times: 7
          },
          {
              text: "أعوذ بكلمات الله التامة من كل شيطان وهامة ومن كل عين لامة",
              times: 7
          },
          {
              text: " بسم الله أرقيك , من كل شيء يؤذيك , ومن كل نفس أو عين حاسد الله يشفيك , بسم الله أرقيك",
              times: 7
          },
          {
              text: "بسم الله",
              times: 3
          },
          {
              text: "أعوذ بعزة الله وقدرته من شر ما أجد وأحاذر",
              times: 7
          },
          {
              text: "أعوذ بكلمات الله التامات من شر ما خلق",
              times: 7
          },
          {
              text: "أعوذ بكلمات الله التامات من غضبه وعقابه وشر عباده ومن همزات الشياطين وأن يحضرون",
              times: 7
          },
          {
              text: "أعوذ بكلمات الله التامات التي لا يجاوزهن بر ولا فاجر من شر ما خلق وبرأ ودرأ , ومن شر ما ينزل من السماء , ومن شر ما يعرج فيها ومن شر ما ذرأ في الأرض ومن شر ما يخرج منها ومن شر فتن الليل والنهار , ومن شر كل طارق إلا طارقا بخير , يا رحمان ",
              times: 7
          },
          {
              text: "اللهم اشف عبدك ينكأ لك عدوا أو يمشي لك إلى صلاة",
              times: 7
          }
      ]
  },
  {
      id: "almrath",
      name: "دعــاء للمريــض",
      prayers: [
          {
              text: "عن ابن عباس رضي الله عنهما عن النبي - صلى الله عليه وسلم - قال: «من عاد مريضا لم يحضره أجله، فقال عنده سبع مرات: أسأل الله العظيم، رب العرش العظيم، أن يشفيك، إلا عافاه الله من ذلك المرض» . رواه أبو داود والترمذي",
              times: 7
          }
      ]
  },
  {
      id: "ast5arh",
      name: "دعــاء الاستخــارة",
      prayers: [
          {
              text: "اللَّهُمَّ إنِّي أَسْتَخِيرُكَ بِعِلْمِكَ , وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ , وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ فَإِنَّكَ تَقْدِرُ وَلا أَقْدِرُ , وَتَعْلَمُ وَلا أَعْلَمُ , وَأَنْتَ عَلامُ الْغُيُوبِ , اللَّهُمَّ إنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ (هنا تسمي حاجتك ) خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي أَوْ قَالَ : عَاجِلِ أَمْرِي وَآجِلِهِ , فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ , اللَّهُمَّ وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ (هنا تسمي حاجتك ) شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي أَوْ قَالَ : عَاجِلِ أَمْرِي وَآجِلِهِ , فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِي الْخَيْرَ حَيْثُ كَانَ ثُمَّ ارْضِنِي بِهِ . وَيُسَمِّي حَاجَتَهُ )",
              times: 1
          }
      ]
  },
  {
      id: "nigazkar",
      name: "أذكــار المســاء",
      prayers: [
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ }",
              times: 1
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ {آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ * لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ }",
              times: 1
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ * لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ }",
              times: 3
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِنْ شَرِّ مَا خَلَقَ * وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ }",
              times: 3
          },
          {
              text: "بسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ { قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَهِ النَّاسِ * مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ }",
              times: 3
          },
          {
              text: "أمسينا وأمسى الملك لله والحمد لله، لا إله إلاّ اللّه وحده لا شريك له، له الملك وله الحمد، وهو على كلّ شيء قدير، ربّ أسألك خير ما في هذه الليلة وخير ما بعدها، وأعوذ بك من شرّ ما في هذه اللّيلة وشرّ ما بعدها، ربّ أعوذ بك من الكسل وسوء الكبر، ربّ أعوذ بك من عذاب في النّار وعذاب في القبر",
              times: 1
          },
          {
              text: "اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت أبوء لك بنعمتك علي وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت",
              times: 1
          },
          {
              text: "رضيت بالله تعالى ربا وبالإسلام دينا وبمحمد صلى الله عليه وسلم نبياً ورسولاً",
              times: 3
          },
          {
              text: "اللهم إني أمسيت أشهدك وأشهد حملة عرشك وملائكتك وجميع خلقك أنك أنت الله لا إله إلا أنت وأن محمداً عبدك ورسولك",
              times: 4
          },
          {
              text: "اللهم ما أمسى بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك فلك الحمد ولك الشكر",
              times: 1
          },
          {
              text: "حسبى الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم",
              times: 7
          },
          {
              text: "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم",
              times: 3
          },
          {
              text: "اللهم بك أمسينا وبك أصبحنا وبك نحيا وبك نموت وإليك المصير",
              times: 1
          },
          {
              text: "أمسينا على فطرة الإسلام وكلمة الإخلاص وعلى دين نبينا محمد صلى الله عليه وسلم وعلى ملة أبينا إبراهيم حنيفاً وما كان من المشركين",
              times: 1
          },
          {
              text: "سبحان الله وبحمده عدد خلقهِ ورِضَا نفسِهِ وزِنُة عَرشِهِ ومِداد كلماته",
              times: 3
          },
          {
              text: "اللهم عافني في بدني اللهم عافني في سمعي اللهم عافني في بصري لا إله إلا أنت",
              times: 3
          },
          {
              text: "اللهم إني أعوذ بك من الكفر والفقر اللهم إني أعوذ بك من عذاب القبر لا إله إلا أنت",
              times: 3
          },
          {
              text: "اللهم إني أسألك العافية في الدنيا والآخرة اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي، اللهم استر عوراتي وآمن روعاتي اللهم احفظني من بين يدي ومن خلفي وعن يميني وعن شمالي وأعوذ بعظمتك أن أغتال من تحتي",
              times: 1
          },
          {
              text: "يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طرفة عين",
              times: 3
          },
          {
              text: "أمسينا وأمسى الملك لله ربّ العالمين، اللّهمّ إنّي أسألك خير هذه اللّيلة فتحها ونصرّها، ونورها وبركتها، وهداها، وأعوذ بك من شر ما فيها وشر ما بعدها",
              times: 1
          },
          {
              text: "اللهم فاطر السماوات والأرض عالم الغيب والشهادة رب كل شيء ومليكه أشهد أن لا إله إلا أنت أعوذ بك من شر نفسي ومن شر الشيطان وشركه وأن أقترف على نفسي سوءاً أو أجره إلى مسلم",
              times: 1
          },
          {
              text: "أعوذ بكلمات الله التامات من شر ما خلق",
              times: 3
          },
          {
              text: "اللهم صل وسلم وبارك على نبينا محمد",
              times: 10
          },
          {
              text: "اللّهمّ إنّا نعوذ بك من أن نشرك بك شيئًا نعلمه، ونستغفرك لما لا نعلمه",
              times: 3
          },
          {
              text: "اللهم إني أعوذ بك من الهم والحزن وأعوذ بك من العجز والكسل وأعوذ بك من الجبن والبخل وأعوذ بك من غلبة الدين وقهر الرجال",
              times: 3
          },
          {
              text: "أستغفر الله العظيم الّذي لا إله إلاّ هو، الحيّ القيّوم، وأتوب إليه",
              times: 3
          },
          {
              text: "يا رب لك الحمد كما ينبغي لجلال وجهك ولعظيم سلطانك",
              times: 3
          },
          {
              text: "لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير",
              times: 10
          },
          {
              text: "اللهم أنت ربي لا إله إلا أنت عليك توكلت وأنت رب العرش العظيم ولا حول ولا قوة إلا بالله العلي العظيم ما شاء الله كان وما لم يشأ لم يكن أعلم أن الله على كل شيء قدير وأن الله قد أحاط بكل شيء علماً، اللهم إني أعوذ بك من شر نفسي ومن شر كل دابة أنت آخذ بناصيتها إن ربي على صراط مستقيم",
              times: 1
          },
          {
              text: "سبحان الله وبحمده",
              times: 100
          }
      ]
  },
  {
      id: "pryazkar",
      name: "أذكــار الصــلاة",
      prayers: [
          {
              text: "عند الذهاب الى المسجد { اللهم اجعل قلبي نوراً ، وفي لساني نوراً ، واجعل في سمعي نوراً ، واجعل في بصري نوراً ، واجعل في خلفي نوراً ، ومن أمامي نوراً ، واجعل من فوقي نوراً ومن تحتي نوراً ، اللهم أعطني نوراً }",
              times: 1
          },
          {
              text: "عند دخول المسجد { أعوذ بالله العظيم وبوجهه الكريم وسلطانه القديم من الشيطان الرجيم }",
              times: 1
          },
          {
              text: "عند الخروج من المسجد { بسم الله و الصلاة و السلام على رسول الله ، اللهم اغفر لي ذنوبي اللهم اعصمني من الشيطان الرجيم }",
              times: 1
          }
      ]
  },
  {
      id: "weakuptb",
      name: "أذكــار الإستيقــاظ",
      prayers: [
          {
              text: "الحمد لله الذي أحيانا بعد ما أماتنا واليه النشور",
              times: 1
          },
          {
              text: "الحمد لله الذي عافاني في جسدي ورد علي روحي و أذن لي بذكره",
              times: 1
          },
          {
              text: "لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيْ قدير الحمد لله وسبحان الله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله العلي العظيم رب اغفر لي",
              times: 1
          }
      ]
  },
];

export default allPrayers;
